-- -----------------------------------------------------
-- Заполяем таблицу с расписанием работы аптеки
-- -----------------------------------------------------
INSERT INTO `pharmacy`.`pharmacy_schedule`
(`opening_time`,
`ending_time`,
`opening_time_on_weekands`,
`ending_time_on_weekands`)
VALUES
(STR_TO_DATE('08:00:00', '%H:%i:%s'), STR_TO_DATE('20:00:00', '%H:%i:%s'), STR_TO_DATE('09:00:00', '%H:%i:%s'), STR_TO_DATE('18:00:00', '%H:%i:%s')),
(STR_TO_DATE('08:00:00', '%H:%i:%s'), STR_TO_DATE('23:00:00', '%H:%i:%s'), STR_TO_DATE('09:00:00', '%H:%i:%s'), STR_TO_DATE('20:00:00', '%H:%i:%s')),
(STR_TO_DATE('00:00:00', '%H:%i:%s'), STR_TO_DATE('00:00:00', '%H:%i:%s'), STR_TO_DATE('09:00:00', '%H:%i:%s'), STR_TO_DATE('20:00:00', '%H:%i:%s')),
(STR_TO_DATE('00:00:00', '%H:%i:%s'), STR_TO_DATE('00:00:00', '%H:%i:%s'), STR_TO_DATE('00:00:00', '%H:%i:%s'), STR_TO_DATE('00:00:00', '%H:%i:%s'));

-- -----------------------------------------------------
-- Заполяем таблицу с аптеками
-- -----------------------------------------------------
INSERT INTO `pharmacy`.`pharmacy`
(`name`,
`address`,
`phone_number`,
`pharmacy_schedule_id`)
VALUES
('Аптека №1', 'ул. Московская, 27а', '+78652287669', 1),
('Аптека у дома', 'ул. 60 лет Октября, д. 2', '+74872418114', 2),
('Аптека Здоровья', 'Торховский пр-д, 10', '+73912041477', 3),
('Народная Аптека', 'ул. Биологическая 18', '‎+78332650892', 4);


-- -----------------------------------------------------
-- Заполяем таблицу с ролями
-- -----------------------------------------------------
INSERT INTO `pharmacy`.`role` 
(name) 
VALUES
('Пользователь'),
('Администратор'),
('Супер администратор');


-- -----------------------------------------------------
-- Заполяем таблицу с пользователями
-- -----------------------------------------------------
INSERT INTO `pharmacy`.`users`
(`name`,
`birth_day`,
`phone_number`,
`login`,
`password`,
`role_id`,
`pharmacy_id`)
VALUES
('admin', STR_TO_DATE('20.03.1968', '%d.%m.%Y'), '+71111111111', 'admin', 'admin', 3, NULL),
('Иванов Иван Иванович', STR_TO_DATE('01.03.1997', '%d.%m.%Y'), '+79657745120', 'IvanII', 'Ivan123456', 1, NULL),
('Кузнецов Илья Владимирович', STR_TO_DATE('17.04.1986', '%d.%m.%Y'), '+79975677324', 'KyznecovIV', 'Kyznecov1986', 2, 1),
('Кузнецов Илья Олегович', STR_TO_DATE('17.04.1986', '%d.%m.%Y'), '+79975677324', 'KyznecovIO', 'Kyznecov1986', 2, 2),
('Кузнецов Илья Александрович', STR_TO_DATE('17.04.1986', '%d.%m.%Y'), '+79975677324', 'KyznecovIA', 'Kyznecov1986', 2, 3),
('Ставрапольски Николай Вячеславович', STR_TO_DATE('20.03.1968', '%d.%m.%Y'), '+79664577892', 'StavropolskyNV', 'StavropolskyNV1', 1, NULL),
('Кудряш Ирина Олеговна', STR_TO_DATE('01.06.1977', '%d.%m.%Y'), '+78799655431', 'Irina01061977', 'Irina01061977!', 1, NULL);


-- -----------------------------------------------------
-- Заполяем таблицу с категориями
-- -----------------------------------------------------
INSERT INTO `pharmacy`.`category`
(`name`)
VALUES
('Другое'),
('Профилактика и лечение ОРВИ и Гриппа'),
('Первая помощь'),
('Ухо Горло Нос'),
('Уход за полостью рта'),
('Витамины и добавки');


-- -----------------------------------------------------
-- Заполяем таблицу с заводами по производству лекарств
-- -----------------------------------------------------
INSERT INTO `pharmacy`.`medicine_factory`
(`name`,
`address`,
`phone_number`)
VALUES
('ОАО "Уралбиофарм"', 'Куйбышева, 60', '+73432540193'),
('ЗАО "Эвалар"', 'Социалистическая, 23/6', '+73854390084'),
('АО "Фармпроект"', 'Софийская, 14', '+78123319310');


-- -----------------------------------------------------
-- Заполяем таблицу с медицинскими препаратами
-- -----------------------------------------------------

INSERT INTO `pharmacy`.`medicines`
(`name`,
`costs`,
`on_prescription`,
`expiration_date`,
`volume`,
`units_of_measurement`,
`primary_packaging`,
`active_substance`,
`special_properties`,
`release_form`,
`medicine_factory_id`,
`category_id`)
VALUES
('Арбидол Максимум', 364, 0, 'Средний срок годности', '10','шт.' , 'Блистер', 'Умифеновир', 'Беречь от детей', 'Капсулы', 1, 1),
('Активированный уголь', 61, 0, 'Длительный срок годности', '50','шт.', 'Блистер', 'Активированный уголь', 'Хранить в сухом месте, Беречь от детей', 'Таблетки', 2, 2),
('Кагоцел', 306, 0, 'Длительный срок годности', '30', 'шт.', 'Блистер', 'Кагоцел', 'Хранить в защищённом от света месте, Беречь от детей', 'Таблетки', 1, 1),
('Аквалор БЭБИ', 221, 0, 'Длительный срок годности', '150','мл.', 'Пластиковый флакон-капельница', 'Морская вода', 'Беречь от детей', 'Капли', 1, 3),
('Доктор мом пастилки ананас', 188, 0, 'Длительный срок годности', '20', 'шт.', 'Блистер', 'Сухие экстракты солодки и имбиря', 'Хранить в сухом месте, Беречь от детей', 'Пастилки', 2, 1),
('Бальзам золотая звезда', 132, 0, 'Длительный срок годности', '4', 'г.', 'Банка', 'Камфора, Гвоздики цветков масло, Коричника китайского коры масло, Эвкалипта листьев масло, Мяты перечной листьев масло, Левоментол', 'Хранить в сухом месте, Беречь от детей', 'Мазь', 2, 3),
('Супрадин', 897, 0, 'Длительный срок годности', '20', 'шт.', 'Банка', 'Мультиминералы, Минералы, Поливитамины', 'Хранить в сухом месте, Беречь от детей', 'Таблетки шипучие', 3, 5),
('Комбилипен', 202, 0, 'Длительный срок годности', '10', 'шт.', 'Блистер', 'Цианокобаламин, Лидокаин, Пиридоксин, Тиамин', 'Хранить в холодильнике, Хранить в защищённом от света месте, Беречь от детей', 'Ампула', 3, 5),
('Компливит', 257, 0, 'Средний срок годности', '60', 'шт.', 'Блистер', 'Бета-каротин, витамины С, Е, Д, В1, В2, В6, В12, Никотинамид, Фолиевая кислота, Кальций', 'Беречь от детей', 'Таблетки', 3, 5),
('Зубная нить сплат', 187, 0, 'Длительный срок годности', '15', 'м.', 'Пластиковая упаковка', 'Нить из полиэстера', 'Беречь от детей', 'Нить из полиэстера', 3, 4),
('Зубная паста защита от кариеса elmex', 307, 0, 'Длительный срок годности', '90', 'г.', 'Туба', 'Фторид натрия и Хлоргексидин', 'Беречь от детей', 'Зубная паста', 2, 1),
('Перекись водорода', 12, 0, 'Длительный срок годности', '50', 'мл.', 'Флакон', 'Перекись водорода 3%', 'Хранить в защищённом от света месте, Беречь от детей', 'Раствор', 1, 2),
('Фурацилин', 29, 0, 'Длительный срок годности', '20', 'шт.', 'Блистер', 'Нитрофурал', 'Хранить в сухом месте, Хранить в защищённом от света месте, Беречь от детей', 'Таблетки шипучие', 1, 2),
('Адреналин', 100, 1, 'Длительный срок годности', '0.5', 'мл.', 'Блистер', 'Эпинефрин', 'Хранить в защищённом от света месте, Беречь от детей', 'Ампула', 1, 2);


-- -----------------------------------------------------
-- Заполяем таблицу с препаратами в аптеке
-- -----------------------------------------------------
INSERT INTO `pharmacy`.`medicines_has_pharmacy`
(`medicines_id`,
`pharmacy_id`,
`count`)
VALUES
(1,1,23),
(1,2,13),
(1,3,3),
(2,1,21),
(3,2,24),
(4,3,53),
(5,3,1),
(6,2,0),
(7,1,55),
(8,2,43),
(8,1,50),
(9,3,67),
(10,3,86),
(11,2,100),
(12,2,12),
(12,1,46),
(13,1,22),
(13,2,25),
(13,3,40),
(14,1,73);


-- -----------------------------------------------------
-- Заполяем таблицу со статусами
-- -----------------------------------------------------
INSERT INTO `pharmacy`.`status`
(`name`)
VALUES
('Другой'),
('В пути'),
('Ожидает в пункте выдачи'),
('Просрочено'),
('Отменен');


-- -----------------------------------------------------
-- Заполяем таблицу заказов
-- -----------------------------------------------------
INSERT INTO `pharmacy`.`basket_has_users`
(`basket_number`,
`users_id`,
`medicines_id`,
`date`,
`status_id`,
`count`,
`costs`,
`pharmacy_id`)
VALUES
(1, 1, 1, STR_TO_DATE('14.11.2023', '%d.%m.%Y'), 1, 1, 34, 1),
(1, 1, 2, STR_TO_DATE('14.11.2023', '%d.%m.%Y'), 1, 2, 77, 1),
(2, 5, 3, STR_TO_DATE('08.11.2023', '%d.%m.%Y'), 2, 1, 114, 2),
(3, 5, 4, STR_TO_DATE('20.11.2023', '%d.%m.%Y'), 1, 1, 25, 3),
(3, 5, 5, STR_TO_DATE('20.11.2023', '%d.%m.%Y'), 1, 2, 95, 3),
(3, 5, 6, STR_TO_DATE('20.11.2023', '%d.%m.%Y'), 1, 3, 77, 3),
(4, 5, 7, STR_TO_DATE('05.11.2023', '%d.%m.%Y'), 3, 4, 500, 3),
(4, 5, 8, STR_TO_DATE('05.11.2023', '%d.%m.%Y'), 3, 5, 365, 3),
(5, 6, 1, STR_TO_DATE('14.11.2023', '%d.%m.%Y'), 1, 10, 101, 1);
















